# GetOtherAnalyticalNode Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..GetOtherAnalyticalNode Method
MEPNetworkIterator Class See Also
---
Gets the other analytical node at the current iteration step.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public MEPAnalyticalNode GetOtherAnalyticalNode()
```

Visual Basic
---
```text
Public Function GetOtherAnalyticalNode As MEPAnalyticalNode
```

Visual C++
---
```text
public:
MEPAnalyticalNode^ GetOtherAnalyticalNode()
```

# ### Return Value
The retrieved analytical node, null if the current iteration step does not have additional analytical node.
# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace